Revit 2027 API
PanelScheduleSheetInstance.GetSchedule Method
 Gets the panel schedule view.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PanelScheduleView GetSchedule()
Public Function GetSchedule As PanelScheduleView
public:
PanelScheduleView^ GetSchedule()
member GetSchedule : unit -> PanelScheduleView
Return Value
PanelScheduleView
 The panel schedule view element.
See Also
Reference
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace